
auto = {
    "Модель": "Lada Vesta",
    "Год выпуска": "2015",
    "Регистрационный номер": "е215ва159",
    "Заводской №": "109186",
    "Объем двигателя, см3": "1,8",
    "Начальный пробег автоб, км": "158"
}

ownerAuto = {
    "ФИО": ["Иванов", "Иван", "Иванович"],
    "Адрес": ["Россия", "Пермский край", "г.Пермь", "ул.Попова", 20, 15],
    "Телефон": "89026316888",
    "E-mail": "email@email.ru"
}

bookAuto = {
    "Владелец": ownerAuto,
    "Автомобиль": auto,
    "Дата": "Хэтчбэк",
    "Пробег": "",
    "Выполненная работа": "Хэтчбэк",
    "Материалы": "Хэтчбэк",
    "Мастер": "Хэтчбэк",
    "Стоимость работ": "",
    "Примечание/рекомендации": "Хэтчбэк"
}

fkfkkasdf