from pprint import pprint
from datetime import date

# Функция создания сервисной книги
def сreateBook(**ownerAuto):
    book = {
        "Владелец": ownerAuto["owner"],
        "Автомобиль": ownerAuto["auto"], 
        "Технический осмотр": list()
    }
    return book

# Данные для создания книги
dataOwner = {"owner" : {
        "Модель": "Lada Vesta",
        "Год выпуска": "2015",
        "Регистрационный номер": "е215ва159",
        "Заводской №": "109186",
        "Объем двигателя, л": "1.8",
        "Начальный пробег автоб, км": "158"
    }, "auto" : {
    "ФИО": ["Иванов", "Иван", "Иванович"],
    "Адрес": ["Россия", "Пермский край", "г.Пермь", "ул.Попова", 20, 15],
    "Телефон": "89026316888",
    "E-mail": "email@email.ru"
    }
}

# Вызов метода по созданию сервисной книги
book = сreateBook(**dataOwner)

# Вывод данных сервисной книги
pprint(book)
